# Get2DContextHandle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..Get2DContextHandle Method
ExporterIFC Class See Also
---
Obtains the IfcRepresentationContext handle to be used for 2D entities (Annotations).
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IFCAnyHandle Get2DContextHandle()
```

Visual Basic
---
```text
Public Function Get2DContextHandle As IFCAnyHandle
```

Visual C++
---
```text
public:
IFCAnyHandle^ Get2DContextHandle()
```

# ### Return Value
The IfcRepresentationContext.
# Remarks
The context handle is automatically applied with a 1:100 scale.
# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace